# Handling missing data in csv

In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'Name' : ['Aryan', np.nan, 'Ayush', 'Arpit'],
    'RollNo' : [np.nan, 2, 3, 4],
    'Course' : ['BCA', 'MBA', np.nan, 'BBA'],
    'CGPA' : [8.8, 9.2, 9.1, np.nan]
}

In [12]:
df = pd.DataFrame(data)
print(df)

    Name  RollNo Course  CGPA
0  Aryan     NaN    BCA   8.8
1    NaN     2.0    MBA   9.2
2  Ayush     3.0    NaN   9.1
3  Arpit     4.0    BBA   NaN

In [13]:
df.isnull()

    Name  RollNo  Course   CGPA
0  False    True   False  False
1   True   False   False  False
2  False   False    True  False
3  False   False   False   True

In [20]:
df['RollNo'].fillna(df['RollNo'].mean(), inplace = True)
df['CGPA'].fillna(df['CGPA'].median(), inplace = True)
print(df)

    Name  RollNo Course      CGPA
0  Aryan     3.0    BCA  8.800000
1    NaN     2.0    MBA  9.200000
2  Ayush     3.0    NaN  9.100000
3  Arpit     4.0    BBA  9.033333

In [23]:
df['Name'].fillna(df['Name'].mode()[0], inplace = True)
df['Course'].fillna(df['Course'].mode()[0], inplace = True)
print(df)

    Name  RollNo Course      CGPA
0  Aryan     3.0    BCA  8.800000
1  Arpit     2.0    MBA  9.200000
2  Ayush     3.0    BBA  9.100000
3  Arpit     4.0    BBA  9.033333